---
kind: type
id: T:Autodesk.Revit.DB.SlantedOrVerticalColumnType
source: html/5969d528-eb60-e268-f09e-38aca3179c14.htm
---
# Autodesk.Revit.DB.SlantedOrVerticalColumnType

This enum class is used for the BuiltInParameter SLANTED_COLUMN_TYPE_PARAM.

## Syntax (C#)
```csharp
public enum SlantedOrVerticalColumnType
```